Revit 2027 API
ProjectLocationSet.Erase Method
Removes a specified project location from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	ProjectLocation item
)
Public Overridable Function Erase (
	item As ProjectLocation
) As Integer
public:
virtual int Erase(
	ProjectLocation^ item
)
abstract Erase :
        item : ProjectLocation -> int
override Erase :
        item : ProjectLocation -> int
Parameters
item ProjectLocation
The project location to be erased.
Return Value
Int32
The number of project locations that were erased from the set.
See Also
Reference
ProjectLocationSet Class
Autodesk.Revit.DB Namespace